{
  "personal": {
    "name": {
      "en": "LE QUANG DAI DI",
      "vi": "LÊ QUANG ĐẠI DĨ"
    },
    "title": {
      "en": "SECURITY ENGINEER | FORMER SOC ANALYST | BACKEND DEVELOPER",
      "vi": "KỸ SƯ BẢO MẬT | CỰU CHUYÊN VIÊN SOC | LẬP TRÌNH VIÊN BACKEND"
    },
    "contact": [
      {
        "icon": "📱",
        "value": "0929860265"
      },
      {
        "icon": "✉️",
        "value": "dile8861@gmail.com"
      }
    ]
  },
  "downloadUrls": {
    "vi": "https://drive.google.com/file/d/1llEB7LThVNQG9oFtEeUAecJ2pc0LUoZc/view?usp=sharing",
    "en": "https://drive.google.com/file/d/1bct2aEJGpdQ2CokgOcsBUUfqPvRddEXK/view"
  },
  "pages": [
    {
      "sections": ["about", "skills", "education", "experience"]
    }
  ],
  "sections": {
    "about": {
      "title": {
        "en": "About Me",
        "vi": "Giới Thiệu"
      },
      "content": {
        "en": "Security Engineer with a strong technical foundation in backend software development and system security monitoring. Experienced in real-world incident analysis, building SIEM-based monitoring systems, deploying vulnerability assessment tools, and integrating the MITRE ATT&CK framework. Proficient in designing APIs, handling large-scale data processing, and deploying distributed systems on AWS. Career objective is to become a DevSecOps or Security Engineer capable of securing systems from the application layer down to the infrastructure level.",
        "vi": "Kỹ sư Bảo mật với nền tảng kỹ thuật vững chắc trong phát triển phần mềm backend và giám sát bảo mật hệ thống. Có kinh nghiệm trong phân tích sự cố thực tế, xây dựng hệ thống giám sát dựa trên SIEM, triển khai công cụ đánh giá lỗ hổng và tích hợp framework MITRE ATT&CK. Thành thạo trong thiết kế API, xử lý dữ liệu quy mô lớn và triển khai hệ thống phân tán trên AWS. Mục tiêu nghề nghiệp là trở thành một DevSecOps hoặc Kỹ sư Bảo mật có khả năng bảo vệ hệ thống từ tầng ứng dụng xuống tầng hạ tầng."
      }
    },
    "skills": {
      "title": {
        "en": "Technical Skills",
        "vi": "Kỹ Năng Chuyên Môn"
      },
      "categories": [
        {
          "title": {
            "en": "Programming & Development:",
            "vi": "Lập trình & Phát triển:"
          },
          "skills": {
            "en": "Python, TypeScript, FastAPI, Django, Flask, Angular, MITRE ATT&CK®",
            "vi": "Python, TypeScript, FastAPI, Django, Flask, Angular, MITRE ATT&CK®"
          }
        },
        {
          "title": {
            "en": "Cloud & DevOps:",
            "vi": "Đám mây & DevOps:"
          },
          "skills": {
            "en": "AWS (Lambda, API Gateway, CloudWatch,...), GitHub Actions (CI/CD), AWS deployment automation",
            "vi": "AWS (Lambda, API Gateway, CloudWatch,...), GitHub Actions (CI/CD), Tự động hóa triển khai AWS"
          }
        },
        {
          "title": {
            "en": "Security Tools & Monitoring:",
            "vi": "Công cụ Bảo mật & Giám sát:"
          },
          "skills": {
            "en": "OpenVAS, Splunk, Wazuh, Nmap,...",
            "vi": "OpenVAS, Splunk, Wazuh, Nmap,..."
          }
        },
        {
          "title": {
            "en": "Databases:",
            "vi": "Cơ sở dữ liệu:"
          },
          "skills": {
            "en": "SQL, MySQL, DynamoDB, DocumentDB, MongoDB",
            "vi": "SQL, MySQL, DynamoDB, DocumentDB, MongoDB"
          }
        },
        {
          "title": {
            "en": "Others:",
            "vi": "Khác:"
          },
          "skills": {
            "en": "Figma, Git",
            "vi": "Figma, Git"
          }
        }
      ]
    },
    "education": {
      "title": {
        "en": "Education",
        "vi": "Học Vấn"
      },
      "items": [
        {
          "institution": {
            "en": "Gia Dinh University",
            "vi": "Đại học Gia Định"
          },
          "gpa": "GPA: 3.5/4.0"
        }
      ]
    },
    "experience": {
      "title": {
        "en": "Experience",
        "vi": "Kinh Nghiệm Làm Việc"
      },
      "items": [
        {
          "company": {
            "en": "BaseBS (BASE BUSINESS SOLUTIONS CORPORATION)",
            "vi": "BaseBS (BASE BUSINESS SOLUTIONS CORPORATION)"
          },
          "duration": {
            "en": "May 2025 – Present",
            "vi": "Tháng 5/2025 – Hiện tại"
          },
          "projects": [
            {
              "title": {
                "en": "Project: uCRM (Unify Customer Request Manage)",
                "vi": "Dự án: uCRM (Quản lý Yêu cầu Khách hàng Thống nhất)"
              },
              "overview": {
                "en": "Provided support for bug fixes and performance optimization of core features.",
                "vi": "Cung cấp hỗ trợ sửa lỗi và tối ưu hóa hiệu suất cho các tính năng cốt lõi."
              },
              "technologies": {
                "en": "Back-end: Python | Framework: Django | Services: Redis, Celery, MongoDB",
                "vi": "Back-end: Python | Framework: Django | Dịch vụ: Redis, Celery, MongoDB"
              },
              "responsibilities": [
                {
                  "en": "Provided support in troubleshooting functional issues and optimizing performance for each product across different agents, tailored to the specific usage needs and priorities of each agent.",
                  "vi": "Cung cấp hỗ trợ khắc phục các vấn đề chức năng và tối ưu hóa hiệu suất cho từng sản phẩm trên các agent khác nhau, được điều chỉnh theo nhu cầu sử dụng cụ thể và ưu tiên của từng agent."
                }
              ],
              "security": [
                {
                  "en": "Access Control for Internal Services",
                  "vi": "Kiểm soát Truy cập Dịch vụ Nội bộ"
                },
                {
                  "en": "Data Protection",
                  "vi": "Bảo vệ Dữ liệu"
                },
                {
                  "en": "Logging & Monitoring",
                  "vi": "Ghi nhật ký & Giám sát"
                },
                {
                  "en": "Secure API Design",
                  "vi": "Thiết kế API An toàn"
                },
                {
                  "en": "Input Validation & Output Encoding",
                  "vi": "Xác thực Đầu vào & Mã hóa Đầu ra"
                }
              ],
              "achievements": {
                "en": "Ensured stable operations and optimized performance of each product across individual agents, delivering tangible and positive benefits tailored to their specific needs.",
                "vi": "Đảm bảo hoạt động ổn định và tối ưu hóa hiệu suất của từng sản phẩm trên các agent riêng lẻ, mang lại lợi ích tích cực và hữu hình phù hợp với nhu cầu cụ thể của họ."
              }
            }
          ]
        },
        {
          "company": {
            "en": "FECredit (Công ty Tài chính TNHH Ngân hàng Việt Nam Thịnh Vượng SMBC)",
            "vi": "FECredit (Công ty Tài chính TNHH Ngân hàng Việt Nam Thịnh Vượng SMBC)"
          },
          "duration": {
            "en": "April 2024 – May 2025",
            "vi": "Tháng 4/2024 – Tháng 5/2025"
          },
          "projects": [
            {
              "title": {
                "en": "Project: Portal",
                "vi": "Dự án: Portal"
              },
              "overview": {
                "en": "A dual-environment portal system (Internal Support & Production Support) designed to support internal operations and handle exception cases in the production environment.",
                "vi": "Hệ thống portal hai môi trường (Hỗ trợ Nội bộ & Hỗ trợ Sản xuất) được thiết kế để hỗ trợ các hoạt động nội bộ và xử lý các trường hợp ngoại lệ trong môi trường sản xuất."
              },
              "technologies": {
                "en": "Front-end: Angular | Back-end: AWS(Python) | AWS Services: API Gateway, Lambda, S3, Secret Manager, SQS, CloudWatch, DynamoDB, DocumentDB, MySQL | Others: AWS Power Tools, GitHub Actions (CI/CD), Figma",
                "vi": "Front-end: Angular | Back-end: AWS(Python) | Dịch vụ AWS: API Gateway, Lambda, S3, Secret Manager, SQS, CloudWatch, DynamoDB, DocumentDB, MySQL | Khác: AWS Power Tools, GitHub Actions (CI/CD), Figma"
              },
              "responsibilities": [
                {
                  "en": "Internal Environment: Designed and maintained an internal testing portal for QA/QC teams to simulate user flows before production deployment, based on pre-defined business rules.",
                  "vi": "Môi trường Nội bộ: Thiết kế và duy trì portal kiểm thử nội bộ cho các đội QA/QC để mô phỏng luồng người dùng trước khi triển khai sản xuất, dựa trên các quy tắc kinh doanh được định nghĩa trước."
                },
                {
                  "en": "Production Environment: Handled exception-based business logic triggered by JIRA tickets.",
                  "vi": "Môi trường Sản xuất: Xử lý logic kinh doanh dựa trên ngoại lệ được kích hoạt bởi các ticket JIRA."
                },
                {
                  "en": "Implemented large-scale notification systems for up to 3 million customers based on dynamic business criteria.",
                  "vi": "Triển khai hệ thống thông báo quy mô lớn cho tới 3 triệu khách hàng dựa trên các tiêu chí kinh doanh động."
                }
              ],
              "achievements": {
                "en": "• Significantly reduced ticket resolution time, improving operational efficiency and response rates.<br>• Ensured uninterrupted PROD operations, helping prevent customer impact and business disruptions.<br>• Reduced QA/QC workload by providing an isolated, realistic testing environment, decreasing time to test and minimizing production bugs.",
                "vi": "• Giảm đáng kể thời gian giải quyết ticket, cải thiện hiệu quả hoạt động và tỷ lệ phản hồi.<br>• Đảm bảo hoạt động PROD không bị gián đoạn, giúp ngăn ngừa tác động đến khách hàng và gián đoạn kinh doanh.<br>• Giảm khối lượng công việc QA/QC bằng cách cung cấp môi trường kiểm thử tách biệt, thực tế, giảm thời gian kiểm thử và tối thiểu hóa lỗi sản xuất."
              }
            },
            {
              "title": {
                "en": "Project: Voolo",
                "vi": "Dự án: Voolo"
              },
              "overview": {
                "en": "A 'Buy Now – Pay Later' financial solution allowing customers to register and purchase products with flexible installment options.",
                "vi": "Một giải pháp tài chính 'Mua Ngay – Trả Sau' cho phép khách hàng đăng ký và mua sản phẩm với các tùy chọn trả góp linh hoạt."
              },
              "technologies": {
                "en": "Back-end: Python | AWS Services: API Gateway, Lambda, S3, Secret Manager, SQS, CloudWatch, Power Tools | Databases: DynamoDB, DocumentDB, MySQL",
                "vi": "Back-end: Python | Dịch vụ AWS: API Gateway, Lambda, S3, Secret Manager, SQS, CloudWatch, Power Tools | Cơ sở dữ liệu: DynamoDB, DocumentDB, MySQL"
              },
              "responsibilities": [
                {
                  "en": "Developed the complete customer onboarding workflow based on detailed BRD documentation provided by business analysts.",
                  "vi": "Phát triển quy trình onboarding khách hàng hoàn chỉnh dựa trên tài liệu BRD chi tiết được cung cấp bởi các nhà phân tích kinh doanh."
                },
                {
                  "en": "Designed APIs and implemented registration logic for stages including personal data collection, identity verification, and cross-checking.",
                  "vi": "Thiết kế API và triển khai logic đăng ký cho các giai đoạn bao gồm thu thập dữ liệu cá nhân, xác minh danh tính và kiểm tra chéo."
                },
                {
                  "en": "Conducted API testing using Postman and Pytest to ensure stability and reliability before release.",
                  "vi": "Tiến hành kiểm thử API bằng Postman và Pytest để đảm bảo tính ổn định và tin cậy trước khi phát hành."
                }
              ]
            }
          ]
        },
        {
          "company": {
            "en": "HTC Global Solutions and Services Joint Stock Company",
            "vi": "Công ty Cổ phần Giải pháp và Dịch vụ Toàn cầu HTC"
          },
          "duration": {
            "en": "April 2023 – January 2024",
            "vi": "Tháng 4/2023 – Tháng 1/2024"
          },
          "projects": [
            {
              "title": {
                "en": "Project: OpenVAS Integration with Splunk",
                "vi": "Dự án: Tích hợp OpenVAS với Splunk"
              },
              "overview": {
                "en": "This project focuses on collecting and analyzing security vulnerability information from the OpenVAS system and transferring the logs to the Splunk security information and event management (SIEM) system for analysis and monitoring.",
                "vi": "Dự án này tập trung vào việc thu thập và phân tích thông tin lỗ hổng bảo mật từ hệ thống OpenVAS và chuyển các log đến hệ thống quản lý thông tin và sự kiện bảo mật (SIEM) Splunk để phân tích và giám sát."
              },
              "technologies": {
                "en": "Tools: OpenVAS | SIEM: Splunk",
                "vi": "Công cụ: OpenVAS | SIEM: Splunk"
              },
              "responsibilities": [
                {
                  "en": "Conduct vulnerability scans on a list of servers within the system.",
                  "vi": "Thực hiện quét lỗ hổng trên danh sách các máy chủ trong hệ thống."
                },
                {
                  "en": "Transfer vulnerability logs from OpenVAS to the Splunk system for analysis.",
                  "vi": "Chuyển các log lỗ hổng từ OpenVAS đến hệ thống Splunk để phân tích."
                },
                {
                  "en": "Build a vulnerability monitoring system to provide timely alerts for potential security issues.",
                  "vi": "Xây dựng hệ thống giám sát lỗ hổng để cung cấp cảnh báo kịp thời cho các vấn đề bảo mật tiềm ẩn."
                }
              ],
              "achievements": {
                "en": "• Successfully integrated OpenVAS vulnerability scanning with Splunk, significantly reducing the time needed to detect and address security vulnerabilities.<br>• Enhanced security monitoring and vulnerability management capabilities, ensuring the system remains secure.",
                "vi": "• Tích hợp thành công quét lỗ hổng OpenVAS với Splunk, giảm đáng kể thời gian cần thiết để phát hiện và giải quyết các lỗ hổng bảo mật.<br>• Nâng cao khả năng giám sát bảo mật và quản lý lỗ hổng, đảm bảo hệ thống luôn an toàn."
              }
            },
            {
              "title": {
                "en": "Project: Building a Security Monitoring System",
                "vi": "Dự án: Xây dựng Hệ thống Giám sát Bảo mật"
              },
              "overview": {
                "en": "This project aimed to develop a comprehensive security monitoring system capable of detecting threats, security vulnerabilities, and network attacks by collecting logs from various sources and providing alerts when security incidents occur.",
                "vi": "Dự án này nhằm phát triển một hệ thống giám sát bảo mật toàn diện có khả năng phát hiện các mối đe dọa, lỗ hổng bảo mật và các cuộc tấn công mạng bằng cách thu thập log từ nhiều nguồn khác nhau và cung cấp cảnh báo khi xảy ra sự cố bảo mật."
              },
              "technologies": {
                "en": "SIEM: Splunk | Tools: Splunk Studio, Figma, Splunk Security",
                "vi": "SIEM: Splunk | Công cụ: Splunk Studio, Figma, Splunk Security"
              },
              "responsibilities": [
                {
                  "en": "Develop a security monitoring system compliant with Official Dispatch 2973, ensuring the detection of at least 10 types of cyberattacks.",
                  "vi": "Phát triển hệ thống giám sát bảo mật tuân thủ Công văn số 2973, đảm bảo phát hiện ít nhất 10 loại tấn công mạng."
                },
                {
                  "en": "Create dashboards for monitoring and alerts, enabling the security team to quickly detect and respond to threats.",
                  "vi": "Tạo dashboard để giám sát và cảnh báo, cho phép đội bảo mật nhanh chóng phát hiện và phản ứng với các mối đe dọa."
                }
              ],
              "achievements": {
                "en": "• Successfully built a security monitoring system that meets the organization's security standards and requirements.<br>• Ensured timely detection of threats, reducing risks and protecting the organization's IT assets.<br>• Strengthened the ability to detect cyberattacks and minimize security incidents by providing real-time alerts.",
                "vi": "• Xây dựng thành công hệ thống giám sát bảo mật đáp ứng các tiêu chuẩn và yêu cầu bảo mật của tổ chức.<br>• Đảm bảo phát hiện kịp thời các mối đe dọa, giảm rủi ro và bảo vệ tài sản CNTT của tổ chức.<br>• Tăng cường khả năng phát hiện các cuộc tấn công mạng và giảm thiểu các sự cố bảo mật bằng cách cung cấp cảnh báo thời gian thực."
              }
            }
          ]
        }
      ]
    }
  }
}